{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3bbe1281",
   "metadata": {},
   "source": [
    "Graph-Based Song Recommendations Using Spotify Audio Feature Vectors \n",
    "\n",
    "A graph-based recommender that moves from familiar songs (Louvain Modularity, Degree Centrality) to new communities by following natural transition paths (Betweenness Centrality, Shortest Path) in the graph\n",
    "\n",
    "Dataset: https://www.kaggle.com/datasets/maharshipandya/-spotify-tracks-dataset\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "fc411739",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "import seaborn as sns\n",
    "%matplotlib inline\n",
    "\n",
    "from sklearn.preprocessing import StandardScaler\n",
    "from sklearn.neighbors import NearestNeighbors\n",
    "from sklearn.metrics.pairwise import cosine_similarity\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "spotify_df = pd.read_csv(\"dataset.csv\", index_col=0)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d93ede69",
   "metadata": {},
   "source": [
    "### EDA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "bc8d736f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(114000, 20)\n",
      "track_id             object\n",
      "artists              object\n",
      "album_name           object\n",
      "track_name           object\n",
      "popularity            int64\n",
      "duration_ms           int64\n",
      "explicit               bool\n",
      "danceability        float64\n",
      "energy              float64\n",
      "key                   int64\n",
      "loudness            float64\n",
      "mode                  int64\n",
      "speechiness         float64\n",
      "acousticness        float64\n",
      "instrumentalness    float64\n",
      "liveness            float64\n",
      "valence             float64\n",
      "tempo               float64\n",
      "time_signature        int64\n",
      "track_genre          object\n",
      "dtype: object\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>track_id</th>\n",
       "      <th>artists</th>\n",
       "      <th>album_name</th>\n",
       "      <th>track_name</th>\n",
       "      <th>popularity</th>\n",
       "      <th>duration_ms</th>\n",
       "      <th>explicit</th>\n",
       "      <th>danceability</th>\n",
       "      <th>energy</th>\n",
       "      <th>key</th>\n",
       "      <th>loudness</th>\n",
       "      <th>mode</th>\n",
       "      <th>speechiness</th>\n",
       "      <th>acousticness</th>\n",
       "      <th>instrumentalness</th>\n",
       "      <th>liveness</th>\n",
       "      <th>valence</th>\n",
       "      <th>tempo</th>\n",
       "      <th>time_signature</th>\n",
       "      <th>track_genre</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5SuOikwiRyPMVoIQDJUgSV</td>\n",
       "      <td>Gen Hoshino</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>Comedy</td>\n",
       "      <td>73</td>\n",
       "      <td>230666</td>\n",
       "      <td>False</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.4610</td>\n",
       "      <td>1</td>\n",
       "      <td>-6.746</td>\n",
       "      <td>0</td>\n",
       "      <td>0.1430</td>\n",
       "      <td>0.0322</td>\n",
       "      <td>0.000001</td>\n",
       "      <td>0.3580</td>\n",
       "      <td>0.715</td>\n",
       "      <td>87.917</td>\n",
       "      <td>4</td>\n",
       "      <td>acoustic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>4qPNDBW1i3p13qLCt0Ki3A</td>\n",
       "      <td>Ben Woodward</td>\n",
       "      <td>Ghost (Acoustic)</td>\n",
       "      <td>Ghost - Acoustic</td>\n",
       "      <td>55</td>\n",
       "      <td>149610</td>\n",
       "      <td>False</td>\n",
       "      <td>0.420</td>\n",
       "      <td>0.1660</td>\n",
       "      <td>1</td>\n",
       "      <td>-17.235</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0763</td>\n",
       "      <td>0.9240</td>\n",
       "      <td>0.000006</td>\n",
       "      <td>0.1010</td>\n",
       "      <td>0.267</td>\n",
       "      <td>77.489</td>\n",
       "      <td>4</td>\n",
       "      <td>acoustic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1iJBSr7s7jYXzM8EGcbK5b</td>\n",
       "      <td>Ingrid Michaelson;ZAYN</td>\n",
       "      <td>To Begin Again</td>\n",
       "      <td>To Begin Again</td>\n",
       "      <td>57</td>\n",
       "      <td>210826</td>\n",
       "      <td>False</td>\n",
       "      <td>0.438</td>\n",
       "      <td>0.3590</td>\n",
       "      <td>0</td>\n",
       "      <td>-9.734</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0557</td>\n",
       "      <td>0.2100</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.1170</td>\n",
       "      <td>0.120</td>\n",
       "      <td>76.332</td>\n",
       "      <td>4</td>\n",
       "      <td>acoustic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>6lfxq3CG4xtTiEg7opyCyx</td>\n",
       "      <td>Kina Grannis</td>\n",
       "      <td>Crazy Rich Asians (Original Motion Picture Sou...</td>\n",
       "      <td>Can't Help Falling In Love</td>\n",
       "      <td>71</td>\n",
       "      <td>201933</td>\n",
       "      <td>False</td>\n",
       "      <td>0.266</td>\n",
       "      <td>0.0596</td>\n",
       "      <td>0</td>\n",
       "      <td>-18.515</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0363</td>\n",
       "      <td>0.9050</td>\n",
       "      <td>0.000071</td>\n",
       "      <td>0.1320</td>\n",
       "      <td>0.143</td>\n",
       "      <td>181.740</td>\n",
       "      <td>3</td>\n",
       "      <td>acoustic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5vjLSffimiIP26QG5WcN2K</td>\n",
       "      <td>Chord Overstreet</td>\n",
       "      <td>Hold On</td>\n",
       "      <td>Hold On</td>\n",
       "      <td>82</td>\n",
       "      <td>198853</td>\n",
       "      <td>False</td>\n",
       "      <td>0.618</td>\n",
       "      <td>0.4430</td>\n",
       "      <td>2</td>\n",
       "      <td>-9.681</td>\n",
       "      <td>1</td>\n",
       "      <td>0.0526</td>\n",
       "      <td>0.4690</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.0829</td>\n",
       "      <td>0.167</td>\n",
       "      <td>119.949</td>\n",
       "      <td>4</td>\n",
       "      <td>acoustic</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 track_id                 artists  \\\n",
       "0  5SuOikwiRyPMVoIQDJUgSV             Gen Hoshino   \n",
       "1  4qPNDBW1i3p13qLCt0Ki3A            Ben Woodward   \n",
       "2  1iJBSr7s7jYXzM8EGcbK5b  Ingrid Michaelson;ZAYN   \n",
       "3  6lfxq3CG4xtTiEg7opyCyx            Kina Grannis   \n",
       "4  5vjLSffimiIP26QG5WcN2K        Chord Overstreet   \n",
       "\n",
       "                                          album_name  \\\n",
       "0                                             Comedy   \n",
       "1                                   Ghost (Acoustic)   \n",
       "2                                     To Begin Again   \n",
       "3  Crazy Rich Asians (Original Motion Picture Sou...   \n",
       "4                                            Hold On   \n",
       "\n",
       "                   track_name  popularity  duration_ms  explicit  \\\n",
       "0                      Comedy          73       230666     False   \n",
       "1            Ghost - Acoustic          55       149610     False   \n",
       "2              To Begin Again          57       210826     False   \n",
       "3  Can't Help Falling In Love          71       201933     False   \n",
       "4                     Hold On          82       198853     False   \n",
       "\n",
       "   danceability  energy  key  loudness  mode  speechiness  acousticness  \\\n",
       "0         0.676  0.4610    1    -6.746     0       0.1430        0.0322   \n",
       "1         0.420  0.1660    1   -17.235     1       0.0763        0.9240   \n",
       "2         0.438  0.3590    0    -9.734     1       0.0557        0.2100   \n",
       "3         0.266  0.0596    0   -18.515     1       0.0363        0.9050   \n",
       "4         0.618  0.4430    2    -9.681     1       0.0526        0.4690   \n",
       "\n",
       "   instrumentalness  liveness  valence    tempo  time_signature track_genre  \n",
       "0          0.000001    0.3580    0.715   87.917               4    acoustic  \n",
       "1          0.000006    0.1010    0.267   77.489               4    acoustic  \n",
       "2          0.000000    0.1170    0.120   76.332               4    acoustic  \n",
       "3          0.000071    0.1320    0.143  181.740               3    acoustic  \n",
       "4          0.000000    0.0829    0.167  119.949               4    acoustic  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(spotify_df.shape)\n",
    "print(spotify_df.dtypes)\n",
    "spotify_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "853df929",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "album_name          1\n",
       "track_name          1\n",
       "artists             1\n",
       "track_id            0\n",
       "speechiness         0\n",
       "time_signature      0\n",
       "tempo               0\n",
       "valence             0\n",
       "liveness            0\n",
       "instrumentalness    0\n",
       "acousticness        0\n",
       "loudness            0\n",
       "mode                0\n",
       "key                 0\n",
       "energy              0\n",
       "danceability        0\n",
       "explicit            0\n",
       "duration_ms         0\n",
       "popularity          0\n",
       "track_genre         0\n",
       "dtype: int64"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# handle missing data\n",
    "spotify_df.isnull().sum().sort_values(ascending=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "2ae0b0c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "spotify_df = spotify_df.dropna(subset=['album_name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "be6bcd58",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "24259\n",
      "                      track_id            artists  \\\n",
      "15028   001APMDOl3qtx1526T11n1  Pink Sweat$;Kirby   \n",
      "103211  001APMDOl3qtx1526T11n1  Pink Sweat$;Kirby   \n",
      "85578   001YQlnDSduXd5LgBd66gT        Soda Stereo   \n",
      "100420  001YQlnDSduXd5LgBd66gT        Soda Stereo   \n",
      "91801   003vvx7Niy0yvhvHt4a68B        The Killers   \n",
      "...                        ...                ...   \n",
      "72679   7zv2vmZq8OjS54BxFzI2wM             Attila   \n",
      "22326   7zv2vmZq8OjS54BxFzI2wM             Attila   \n",
      "2004    7zwn1eykZtZ5LODrf7c0tS  The Neighbourhood   \n",
      "3100    7zwn1eykZtZ5LODrf7c0tS  The Neighbourhood   \n",
      "91401   7zwn1eykZtZ5LODrf7c0tS  The Neighbourhood   \n",
      "\n",
      "                                             album_name  \\\n",
      "15028                                           New RnB   \n",
      "103211                                          New RnB   \n",
      "85578                          Soda Stereo (Remastered)   \n",
      "100420                         Soda Stereo (Remastered)   \n",
      "91801                                          Hot Fuss   \n",
      "...                                                 ...   \n",
      "72679                     Soundtrack to a Party (Bonus)   \n",
      "22326                     Soundtrack to a Party (Bonus)   \n",
      "2004    Hard To Imagine The Neighbourhood Ever Changing   \n",
      "3100    Hard To Imagine The Neighbourhood Ever Changing   \n",
      "91401   Hard To Imagine The Neighbourhood Ever Changing   \n",
      "\n",
      "                                      track_name  popularity  duration_ms  \\\n",
      "15028                                     Better           0       176320   \n",
      "103211                                    Better           0       176320   \n",
      "85578   El Tiempo Es Dinero - Remasterizado 2007          38       177266   \n",
      "100420  El Tiempo Es Dinero - Remasterizado 2007          38       177266   \n",
      "91801                             Mr. Brightside          86       222973   \n",
      "...                                          ...         ...          ...   \n",
      "72679                       Lets Start the Party          25       125859   \n",
      "22326                       Lets Start the Party          25       125859   \n",
      "2004                          You Get Me So High          83       153000   \n",
      "3100                          You Get Me So High          83       153000   \n",
      "91401                         You Get Me So High          83       153000   \n",
      "\n",
      "        explicit  danceability  energy  key  loudness  mode  speechiness  \\\n",
      "15028      False         0.613   0.471    1    -6.644     0       0.1070   \n",
      "103211     False         0.613   0.471    1    -6.644     0       0.1070   \n",
      "85578      False         0.554   0.921    2    -4.589     1       0.0758   \n",
      "100420     False         0.554   0.921    2    -4.589     1       0.0758   \n",
      "91801      False         0.352   0.911    1    -5.230     1       0.0747   \n",
      "...          ...           ...     ...  ...       ...   ...          ...   \n",
      "72679       True         0.592   0.932    1    -5.412     1       0.0558   \n",
      "22326       True         0.592   0.932    1    -5.412     1       0.0558   \n",
      "2004       False         0.551   0.881    7    -6.099     0       0.0542   \n",
      "3100       False         0.551   0.881    7    -6.099     0       0.0542   \n",
      "91401      False         0.551   0.881    7    -6.099     0       0.0542   \n",
      "\n",
      "        acousticness  instrumentalness  liveness  valence    tempo  \\\n",
      "15028       0.316000          0.000001    0.1170    0.406  143.064   \n",
      "103211      0.316000          0.000001    0.1170    0.406  143.064   \n",
      "85578       0.019400          0.088100    0.3290    0.700  183.571   \n",
      "100420      0.019400          0.088100    0.3290    0.700  183.571   \n",
      "91801       0.001210          0.000000    0.0995    0.236  148.033   \n",
      "...              ...               ...       ...      ...      ...   \n",
      "72679       0.000005          0.859000    0.0730    0.677  133.987   \n",
      "22326       0.000005          0.859000    0.0730    0.677  133.987   \n",
      "2004        0.186000          0.079100    0.1520    0.387   88.036   \n",
      "3100        0.186000          0.079100    0.1520    0.387   88.036   \n",
      "91401       0.186000          0.079100    0.1520    0.387   88.036   \n",
      "\n",
      "        time_signature  track_genre  \n",
      "15028                4        chill  \n",
      "103211               4         soul  \n",
      "85578                1    punk-rock  \n",
      "100420               1          ska  \n",
      "91801                4         rock  \n",
      "...                ...          ...  \n",
      "72679                4    metalcore  \n",
      "22326                4  death-metal  \n",
      "2004                 4     alt-rock  \n",
      "3100                 4  alternative  \n",
      "91401                4         rock  \n",
      "\n",
      "[40900 rows x 20 columns]\n"
     ]
    }
   ],
   "source": [
    "# verify if track_id is a good unique identifier\n",
    "trackid_dupes = spotify_df['track_id'].duplicated().sum()\n",
    "print(trackid_dupes)\n",
    "\n",
    "# investigate duplicates\n",
    "trackid_dupes = spotify_df[spotify_df['track_id'].duplicated(keep=False)]\n",
    "print(trackid_dupes.sort_values('track_id'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "684b1730",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(81343, 20)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# remove track_id duplicates (same song across different album versions) keeping most popular one\n",
    "spotify_df.sort_values(by='popularity', ascending=False, inplace=True) \n",
    "spotify_df.drop_duplicates(subset='track_id', inplace=True)\n",
    "\n",
    "# remove \n",
    "spotify_df.drop_duplicates(subset=['track_name','artists'], inplace=True)\n",
    "spotify_df.reset_index(drop=True, inplace=True)\n",
    "\n",
    "spotify_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8ffcc42b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>danceability</th>\n",
       "      <th>energy</th>\n",
       "      <th>speechiness</th>\n",
       "      <th>acousticness</th>\n",
       "      <th>instrumentalness</th>\n",
       "      <th>valence</th>\n",
       "      <th>tempo</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>count</th>\n",
       "      <td>81343.000000</td>\n",
       "      <td>81343.000000</td>\n",
       "      <td>81343.000000</td>\n",
       "      <td>81343.000000</td>\n",
       "      <td>81343.000000</td>\n",
       "      <td>81343.000000</td>\n",
       "      <td>81343.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mean</th>\n",
       "      <td>0.559289</td>\n",
       "      <td>0.634911</td>\n",
       "      <td>0.088984</td>\n",
       "      <td>0.329697</td>\n",
       "      <td>0.184747</td>\n",
       "      <td>0.463311</td>\n",
       "      <td>122.134904</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>std</th>\n",
       "      <td>0.177738</td>\n",
       "      <td>0.258637</td>\n",
       "      <td>0.116619</td>\n",
       "      <td>0.339951</td>\n",
       "      <td>0.331606</td>\n",
       "      <td>0.263408</td>\n",
       "      <td>30.123005</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>min</th>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25%</th>\n",
       "      <td>0.446000</td>\n",
       "      <td>0.455000</td>\n",
       "      <td>0.036100</td>\n",
       "      <td>0.015900</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.241000</td>\n",
       "      <td>99.377500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50%</th>\n",
       "      <td>0.573000</td>\n",
       "      <td>0.678000</td>\n",
       "      <td>0.049100</td>\n",
       "      <td>0.190000</td>\n",
       "      <td>0.000089</td>\n",
       "      <td>0.449000</td>\n",
       "      <td>122.028000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75%</th>\n",
       "      <td>0.690000</td>\n",
       "      <td>0.856500</td>\n",
       "      <td>0.087000</td>\n",
       "      <td>0.629000</td>\n",
       "      <td>0.153000</td>\n",
       "      <td>0.676000</td>\n",
       "      <td>140.124000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>max</th>\n",
       "      <td>0.985000</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.965000</td>\n",
       "      <td>0.996000</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.995000</td>\n",
       "      <td>243.372000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       danceability        energy   speechiness  acousticness  \\\n",
       "count  81343.000000  81343.000000  81343.000000  81343.000000   \n",
       "mean       0.559289      0.634911      0.088984      0.329697   \n",
       "std        0.177738      0.258637      0.116619      0.339951   \n",
       "min        0.000000      0.000000      0.000000      0.000000   \n",
       "25%        0.446000      0.455000      0.036100      0.015900   \n",
       "50%        0.573000      0.678000      0.049100      0.190000   \n",
       "75%        0.690000      0.856500      0.087000      0.629000   \n",
       "max        0.985000      1.000000      0.965000      0.996000   \n",
       "\n",
       "       instrumentalness       valence         tempo  \n",
       "count      81343.000000  81343.000000  81343.000000  \n",
       "mean           0.184747      0.463311    122.134904  \n",
       "std            0.331606      0.263408     30.123005  \n",
       "min            0.000000      0.000000      0.000000  \n",
       "25%            0.000000      0.241000     99.377500  \n",
       "50%            0.000089      0.449000    122.028000  \n",
       "75%            0.153000      0.676000    140.124000  \n",
       "max            1.000000      0.995000    243.372000  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# explore relevant numeric audio feature vectors: danceability, energy, speechiness, acousticness, instrumentalness, valence, tempo\n",
    "song_features = spotify_df[['danceability','energy','speechiness','acousticness','instrumentalness','valence', 'tempo']]\n",
    "song_features.describe()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d1684f14",
   "metadata": {},
   "source": [
    "### Correlation heatmap"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "27cdb5b6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "#T_5a3a4_row0_col0, #T_5a3a4_row1_col1, #T_5a3a4_row2_col2, #T_5a3a4_row3_col3, #T_5a3a4_row4_col4, #T_5a3a4_row5_col5, #T_5a3a4_row6_col6 {\n",
       "  background-color: #08306b;\n",
       "  color: #f1f1f1;\n",
       "}\n",
       "#T_5a3a4_row0_col1, #T_5a3a4_row2_col1 {\n",
       "  background-color: #6aaed6;\n",
       "  color: #f1f1f1;\n",
       "}\n",
       "#T_5a3a4_row0_col2 {\n",
       "  background-color: #d1e2f3;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row0_col3 {\n",
       "  background-color: #aed1e7;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row0_col4, #T_5a3a4_row3_col2 {\n",
       "  background-color: #e2edf8;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row0_col5 {\n",
       "  background-color: #4493c7;\n",
       "  color: #f1f1f1;\n",
       "}\n",
       "#T_5a3a4_row0_col6, #T_5a3a4_row2_col4 {\n",
       "  background-color: #d6e5f4;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row1_col0, #T_5a3a4_row2_col5 {\n",
       "  background-color: #bed8ec;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row1_col2 {\n",
       "  background-color: #cbdef1;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row1_col3, #T_5a3a4_row3_col1, #T_5a3a4_row3_col6, #T_5a3a4_row4_col0, #T_5a3a4_row4_col2, #T_5a3a4_row4_col5, #T_5a3a4_row5_col4 {\n",
       "  background-color: #f7fbff;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row1_col4 {\n",
       "  background-color: #e1edf8;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row1_col5 {\n",
       "  background-color: #84bcdb;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row1_col6 {\n",
       "  background-color: #95c5df;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row2_col0 {\n",
       "  background-color: #c6dbef;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row2_col3 {\n",
       "  background-color: #89bedc;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row2_col6 {\n",
       "  background-color: #d3e4f3;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row3_col0 {\n",
       "  background-color: #f3f8fe;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row3_col4 {\n",
       "  background-color: #afd1e7;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row3_col5 {\n",
       "  background-color: #d5e5f4;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row4_col1 {\n",
       "  background-color: #b2d2e8;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row4_col3 {\n",
       "  background-color: #74b3d8;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row4_col6 {\n",
       "  background-color: #dceaf6;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row5_col0, #T_5a3a4_row6_col1 {\n",
       "  background-color: #539ecd;\n",
       "  color: #f1f1f1;\n",
       "}\n",
       "#T_5a3a4_row5_col1 {\n",
       "  background-color: #549fcd;\n",
       "  color: #f1f1f1;\n",
       "}\n",
       "#T_5a3a4_row5_col2 {\n",
       "  background-color: #deebf7;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row5_col3 {\n",
       "  background-color: #a1cbe2;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row5_col6 {\n",
       "  background-color: #c3daee;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row6_col0 {\n",
       "  background-color: #dae8f6;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row6_col2 {\n",
       "  background-color: #e5eff9;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row6_col3 {\n",
       "  background-color: #b8d5ea;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row6_col4 {\n",
       "  background-color: #cfe1f2;\n",
       "  color: #000000;\n",
       "}\n",
       "#T_5a3a4_row6_col5 {\n",
       "  background-color: #b0d2e7;\n",
       "  color: #000000;\n",
       "}\n",
       "</style>\n",
       "<table id=\"T_5a3a4\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th class=\"blank level0\" >&nbsp;</th>\n",
       "      <th id=\"T_5a3a4_level0_col0\" class=\"col_heading level0 col0\" >danceability</th>\n",
       "      <th id=\"T_5a3a4_level0_col1\" class=\"col_heading level0 col1\" >energy</th>\n",
       "      <th id=\"T_5a3a4_level0_col2\" class=\"col_heading level0 col2\" >speechiness</th>\n",
       "      <th id=\"T_5a3a4_level0_col3\" class=\"col_heading level0 col3\" >acousticness</th>\n",
       "      <th id=\"T_5a3a4_level0_col4\" class=\"col_heading level0 col4\" >instrumentalness</th>\n",
       "      <th id=\"T_5a3a4_level0_col5\" class=\"col_heading level0 col5\" >valence</th>\n",
       "      <th id=\"T_5a3a4_level0_col6\" class=\"col_heading level0 col6\" >tempo</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row0\" class=\"row_heading level0 row0\" >danceability</th>\n",
       "      <td id=\"T_5a3a4_row0_col0\" class=\"data row0 col0\" >1.000000</td>\n",
       "      <td id=\"T_5a3a4_row0_col1\" class=\"data row0 col1\" >0.134697</td>\n",
       "      <td id=\"T_5a3a4_row0_col2\" class=\"data row0 col2\" >0.108365</td>\n",
       "      <td id=\"T_5a3a4_row0_col3\" class=\"data row0 col3\" >-0.167839</td>\n",
       "      <td id=\"T_5a3a4_row0_col4\" class=\"data row0 col4\" >-0.191638</td>\n",
       "      <td id=\"T_5a3a4_row0_col5\" class=\"data row0 col5\" >0.491963</td>\n",
       "      <td id=\"T_5a3a4_row0_col6\" class=\"data row0 col6\" >-0.015096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row1\" class=\"row_heading level0 row1\" >energy</th>\n",
       "      <td id=\"T_5a3a4_row1_col0\" class=\"data row1 col0\" >0.134697</td>\n",
       "      <td id=\"T_5a3a4_row1_col1\" class=\"data row1 col1\" >1.000000</td>\n",
       "      <td id=\"T_5a3a4_row1_col2\" class=\"data row1 col2\" >0.139930</td>\n",
       "      <td id=\"T_5a3a4_row1_col3\" class=\"data row1 col3\" >-0.731064</td>\n",
       "      <td id=\"T_5a3a4_row1_col4\" class=\"data row1 col4\" >-0.186146</td>\n",
       "      <td id=\"T_5a3a4_row1_col5\" class=\"data row1 col5\" >0.253539</td>\n",
       "      <td id=\"T_5a3a4_row1_col6\" class=\"data row1 col6\" >0.260598</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row2\" class=\"row_heading level0 row2\" >speechiness</th>\n",
       "      <td id=\"T_5a3a4_row2_col0\" class=\"data row2 col0\" >0.108365</td>\n",
       "      <td id=\"T_5a3a4_row2_col1\" class=\"data row2 col1\" >0.139930</td>\n",
       "      <td id=\"T_5a3a4_row2_col2\" class=\"data row2 col2\" >1.000000</td>\n",
       "      <td id=\"T_5a3a4_row2_col3\" class=\"data row2 col3\" >0.012264</td>\n",
       "      <td id=\"T_5a3a4_row2_col4\" class=\"data row2 col4\" >-0.107059</td>\n",
       "      <td id=\"T_5a3a4_row2_col5\" class=\"data row2 col5\" >0.035096</td>\n",
       "      <td id=\"T_5a3a4_row2_col6\" class=\"data row2 col6\" >-0.003374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row3\" class=\"row_heading level0 row3\" >acousticness</th>\n",
       "      <td id=\"T_5a3a4_row3_col0\" class=\"data row3 col0\" >-0.167839</td>\n",
       "      <td id=\"T_5a3a4_row3_col1\" class=\"data row3 col1\" >-0.731064</td>\n",
       "      <td id=\"T_5a3a4_row3_col2\" class=\"data row3 col2\" >0.012264</td>\n",
       "      <td id=\"T_5a3a4_row3_col3\" class=\"data row3 col3\" >1.000000</td>\n",
       "      <td id=\"T_5a3a4_row3_col4\" class=\"data row3 col4\" >0.095007</td>\n",
       "      <td id=\"T_5a3a4_row3_col5\" class=\"data row3 col5\" >-0.101561</td>\n",
       "      <td id=\"T_5a3a4_row3_col6\" class=\"data row3 col6\" >-0.223376</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row4\" class=\"row_heading level0 row4\" >instrumentalness</th>\n",
       "      <td id=\"T_5a3a4_row4_col0\" class=\"data row4 col0\" >-0.191638</td>\n",
       "      <td id=\"T_5a3a4_row4_col1\" class=\"data row4 col1\" >-0.186146</td>\n",
       "      <td id=\"T_5a3a4_row4_col2\" class=\"data row4 col2\" >-0.107059</td>\n",
       "      <td id=\"T_5a3a4_row4_col3\" class=\"data row4 col3\" >0.095007</td>\n",
       "      <td id=\"T_5a3a4_row4_col4\" class=\"data row4 col4\" >1.000000</td>\n",
       "      <td id=\"T_5a3a4_row4_col5\" class=\"data row4 col5\" >-0.332371</td>\n",
       "      <td id=\"T_5a3a4_row4_col6\" class=\"data row4 col6\" >-0.058773</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row5\" class=\"row_heading level0 row5\" >valence</th>\n",
       "      <td id=\"T_5a3a4_row5_col0\" class=\"data row5 col0\" >0.491963</td>\n",
       "      <td id=\"T_5a3a4_row5_col1\" class=\"data row5 col1\" >0.253539</td>\n",
       "      <td id=\"T_5a3a4_row5_col2\" class=\"data row5 col2\" >0.035096</td>\n",
       "      <td id=\"T_5a3a4_row5_col3\" class=\"data row5 col3\" >-0.101561</td>\n",
       "      <td id=\"T_5a3a4_row5_col4\" class=\"data row5 col4\" >-0.332371</td>\n",
       "      <td id=\"T_5a3a4_row5_col5\" class=\"data row5 col5\" >1.000000</td>\n",
       "      <td id=\"T_5a3a4_row5_col6\" class=\"data row5 col6\" >0.093250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th id=\"T_5a3a4_level0_row6\" class=\"row_heading level0 row6\" >tempo</th>\n",
       "      <td id=\"T_5a3a4_row6_col0\" class=\"data row6 col0\" >-0.015096</td>\n",
       "      <td id=\"T_5a3a4_row6_col1\" class=\"data row6 col1\" >0.260598</td>\n",
       "      <td id=\"T_5a3a4_row6_col2\" class=\"data row6 col2\" >-0.003374</td>\n",
       "      <td id=\"T_5a3a4_row6_col3\" class=\"data row6 col3\" >-0.223376</td>\n",
       "      <td id=\"T_5a3a4_row6_col4\" class=\"data row6 col4\" >-0.058773</td>\n",
       "      <td id=\"T_5a3a4_row6_col5\" class=\"data row6 col5\" >0.093250</td>\n",
       "      <td id=\"T_5a3a4_row6_col6\" class=\"data row6 col6\" >1.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x1c7e32b3a90>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# correlation heatmap\n",
    "corr = song_features.corr().style.background_gradient(cmap='Blues')\n",
    "corr"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "75031ae3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>danceability</th>\n",
       "      <th>energy</th>\n",
       "      <th>speechiness</th>\n",
       "      <th>acousticness</th>\n",
       "      <th>instrumentalness</th>\n",
       "      <th>valence</th>\n",
       "      <th>tempo</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.870451</td>\n",
       "      <td>-0.629886</td>\n",
       "      <td>-0.022162</td>\n",
       "      <td>-0.931603</td>\n",
       "      <td>-0.557117</td>\n",
       "      <td>-0.855374</td>\n",
       "      <td>0.298315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.347205</td>\n",
       "      <td>0.568714</td>\n",
       "      <td>-0.385742</td>\n",
       "      <td>-0.933074</td>\n",
       "      <td>-0.457615</td>\n",
       "      <td>0.329110</td>\n",
       "      <td>0.195802</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1.551233</td>\n",
       "      <td>0.170470</td>\n",
       "      <td>-0.450912</td>\n",
       "      <td>0.745120</td>\n",
       "      <td>-0.557125</td>\n",
       "      <td>1.468036</td>\n",
       "      <td>0.094450</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.009627</td>\n",
       "      <td>1.276274</td>\n",
       "      <td>-0.468919</td>\n",
       "      <td>-0.958578</td>\n",
       "      <td>-0.557110</td>\n",
       "      <td>-0.604810</td>\n",
       "      <td>0.196034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.510368</td>\n",
       "      <td>0.309662</td>\n",
       "      <td>1.406434</td>\n",
       "      <td>-0.677741</td>\n",
       "      <td>-0.556254</td>\n",
       "      <td>-1.048991</td>\n",
       "      <td>-0.513329</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   danceability    energy  speechiness  acousticness  instrumentalness  \\\n",
       "0      0.870451 -0.629886    -0.022162     -0.931603         -0.557117   \n",
       "1      0.347205  0.568714    -0.385742     -0.933074         -0.457615   \n",
       "2      1.551233  0.170470    -0.450912      0.745120         -0.557125   \n",
       "3      0.009627  1.276274    -0.468919     -0.958578         -0.557110   \n",
       "4      0.510368  0.309662     1.406434     -0.677741         -0.556254   \n",
       "\n",
       "    valence     tempo  \n",
       "0 -0.855374  0.298315  \n",
       "1  0.329110  0.195802  \n",
       "2  1.468036  0.094450  \n",
       "3 -0.604810  0.196034  \n",
       "4 -1.048991 -0.513329  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# standardize features to same scale\n",
    "scaler = StandardScaler()\n",
    "spotify_scaled = scaler.fit_transform(song_features)\n",
    "\n",
    "# validate scaled values\n",
    "spotify_scaled_df = pd.DataFrame(spotify_scaled, columns=song_features.columns)\n",
    "spotify_scaled_df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "21b38728",
   "metadata": {},
   "source": [
    "### Genre similarity analysis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "964e41ea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>track_genre</th>\n",
       "      <th>acoustic</th>\n",
       "      <th>afrobeat</th>\n",
       "      <th>alt-rock</th>\n",
       "      <th>alternative</th>\n",
       "      <th>ambient</th>\n",
       "      <th>anime</th>\n",
       "      <th>black-metal</th>\n",
       "      <th>bluegrass</th>\n",
       "      <th>blues</th>\n",
       "      <th>brazil</th>\n",
       "      <th>...</th>\n",
       "      <th>spanish</th>\n",
       "      <th>study</th>\n",
       "      <th>swedish</th>\n",
       "      <th>synth-pop</th>\n",
       "      <th>tango</th>\n",
       "      <th>techno</th>\n",
       "      <th>trance</th>\n",
       "      <th>trip-hop</th>\n",
       "      <th>turkish</th>\n",
       "      <th>world-music</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>track_genre</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>acoustic</th>\n",
       "      <td>1.000000</td>\n",
       "      <td>-0.280143</td>\n",
       "      <td>-0.430991</td>\n",
       "      <td>-0.184975</td>\n",
       "      <td>0.570020</td>\n",
       "      <td>-0.150529</td>\n",
       "      <td>-0.415338</td>\n",
       "      <td>0.450975</td>\n",
       "      <td>0.376841</td>\n",
       "      <td>-0.042728</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.351757</td>\n",
       "      <td>0.217618</td>\n",
       "      <td>0.227485</td>\n",
       "      <td>-0.286997</td>\n",
       "      <td>0.706710</td>\n",
       "      <td>-0.417012</td>\n",
       "      <td>-0.629122</td>\n",
       "      <td>-0.173537</td>\n",
       "      <td>0.271932</td>\n",
       "      <td>0.334291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>afrobeat</th>\n",
       "      <td>-0.280143</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.279385</td>\n",
       "      <td>0.245120</td>\n",
       "      <td>-0.365728</td>\n",
       "      <td>-0.170299</td>\n",
       "      <td>-0.527524</td>\n",
       "      <td>0.187537</td>\n",
       "      <td>0.547222</td>\n",
       "      <td>-0.184240</td>\n",
       "      <td>...</td>\n",
       "      <td>0.391874</td>\n",
       "      <td>0.204192</td>\n",
       "      <td>0.481266</td>\n",
       "      <td>0.631303</td>\n",
       "      <td>0.021132</td>\n",
       "      <td>0.101889</td>\n",
       "      <td>-0.243781</td>\n",
       "      <td>0.488232</td>\n",
       "      <td>0.147716</td>\n",
       "      <td>-0.884927</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>alt-rock</th>\n",
       "      <td>-0.430991</td>\n",
       "      <td>0.279385</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.762513</td>\n",
       "      <td>-0.753278</td>\n",
       "      <td>-0.277437</td>\n",
       "      <td>0.167989</td>\n",
       "      <td>-0.169004</td>\n",
       "      <td>0.417235</td>\n",
       "      <td>-0.084773</td>\n",
       "      <td>...</td>\n",
       "      <td>0.712836</td>\n",
       "      <td>-0.709302</td>\n",
       "      <td>0.566251</td>\n",
       "      <td>0.810342</td>\n",
       "      <td>-0.640016</td>\n",
       "      <td>0.043963</td>\n",
       "      <td>0.193420</td>\n",
       "      <td>-0.222355</td>\n",
       "      <td>0.046206</td>\n",
       "      <td>-0.199120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>alternative</th>\n",
       "      <td>-0.184975</td>\n",
       "      <td>0.245120</td>\n",
       "      <td>0.762513</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>-0.671322</td>\n",
       "      <td>-0.381491</td>\n",
       "      <td>-0.098335</td>\n",
       "      <td>-0.467153</td>\n",
       "      <td>0.551369</td>\n",
       "      <td>0.207739</td>\n",
       "      <td>...</td>\n",
       "      <td>0.706466</td>\n",
       "      <td>-0.504322</td>\n",
       "      <td>0.572566</td>\n",
       "      <td>0.633417</td>\n",
       "      <td>-0.468501</td>\n",
       "      <td>-0.070834</td>\n",
       "      <td>-0.079266</td>\n",
       "      <td>-0.137203</td>\n",
       "      <td>0.483746</td>\n",
       "      <td>-0.182365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ambient</th>\n",
       "      <td>0.570020</td>\n",
       "      <td>-0.365728</td>\n",
       "      <td>-0.753278</td>\n",
       "      <td>-0.671322</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.544671</td>\n",
       "      <td>0.137422</td>\n",
       "      <td>0.200576</td>\n",
       "      <td>-0.226136</td>\n",
       "      <td>-0.351845</td>\n",
       "      <td>...</td>\n",
       "      <td>-0.943847</td>\n",
       "      <td>0.676836</td>\n",
       "      <td>-0.564942</td>\n",
       "      <td>-0.599944</td>\n",
       "      <td>0.516342</td>\n",
       "      <td>0.043812</td>\n",
       "      <td>-0.133769</td>\n",
       "      <td>0.320010</td>\n",
       "      <td>-0.301993</td>\n",
       "      <td>0.519974</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 114 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "track_genre  acoustic  afrobeat  alt-rock  alternative   ambient     anime  \\\n",
       "track_genre                                                                  \n",
       "acoustic     1.000000 -0.280143 -0.430991    -0.184975  0.570020 -0.150529   \n",
       "afrobeat    -0.280143  1.000000  0.279385     0.245120 -0.365728 -0.170299   \n",
       "alt-rock    -0.430991  0.279385  1.000000     0.762513 -0.753278 -0.277437   \n",
       "alternative -0.184975  0.245120  0.762513     1.000000 -0.671322 -0.381491   \n",
       "ambient      0.570020 -0.365728 -0.753278    -0.671322  1.000000  0.544671   \n",
       "\n",
       "track_genre  black-metal  bluegrass     blues    brazil  ...   spanish  \\\n",
       "track_genre                                              ...             \n",
       "acoustic       -0.415338   0.450975  0.376841 -0.042728  ... -0.351757   \n",
       "afrobeat       -0.527524   0.187537  0.547222 -0.184240  ...  0.391874   \n",
       "alt-rock        0.167989  -0.169004  0.417235 -0.084773  ...  0.712836   \n",
       "alternative    -0.098335  -0.467153  0.551369  0.207739  ...  0.706466   \n",
       "ambient         0.137422   0.200576 -0.226136 -0.351845  ... -0.943847   \n",
       "\n",
       "track_genre     study   swedish  synth-pop     tango    techno    trance  \\\n",
       "track_genre                                                                \n",
       "acoustic     0.217618  0.227485  -0.286997  0.706710 -0.417012 -0.629122   \n",
       "afrobeat     0.204192  0.481266   0.631303  0.021132  0.101889 -0.243781   \n",
       "alt-rock    -0.709302  0.566251   0.810342 -0.640016  0.043963  0.193420   \n",
       "alternative -0.504322  0.572566   0.633417 -0.468501 -0.070834 -0.079266   \n",
       "ambient      0.676836 -0.564942  -0.599944  0.516342  0.043812 -0.133769   \n",
       "\n",
       "track_genre  trip-hop   turkish  world-music  \n",
       "track_genre                                   \n",
       "acoustic    -0.173537  0.271932     0.334291  \n",
       "afrobeat     0.488232  0.147716    -0.884927  \n",
       "alt-rock    -0.222355  0.046206    -0.199120  \n",
       "alternative -0.137203  0.483746    -0.182365  \n",
       "ambient      0.320010 -0.301993     0.519974  \n",
       "\n",
       "[5 rows x 114 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Select the audio feature columns for genre analysis\n",
    "genre_features = ['danceability', 'energy', 'loudness', 'speechiness',\n",
    "            'acousticness', 'instrumentalness', 'liveness', 'valence', 'tempo']\n",
    "\n",
    "# Group by genre and get the mean of these features\n",
    "genre_means = spotify_df.groupby('track_genre')[genre_features].mean()\n",
    "\n",
    "# standardize genre profiles\n",
    "scaler = StandardScaler()\n",
    "genre_means_scaled = scaler.fit_transform(genre_means)\n",
    "\n",
    "# compute cosine similarity between genre profiles\n",
    "similarity_matrix = cosine_similarity(genre_means_scaled)\n",
    "similarity_df = pd.DataFrame(similarity_matrix, index=genre_means.index, columns=genre_means.index)\n",
    "\n",
    "similarity_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c536fc32",
   "metadata": {},
   "outputs": [],
   "source": [
    "plt.figure(figsize=(20, 20))\n",
    "sns.clustermap(similarity_df, cmap='viridis', figsize=(15, 15))\n",
    "plt.title('Similarity Cluster Map of Spotify Genres')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c7bea015",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Least similar to show-tunes:\n",
      "track_genre\n",
      "breakbeat           -0.938207\n",
      "party               -0.765994\n",
      "progressive-house   -0.761683\n",
      "industrial          -0.750203\n",
      "j-idol              -0.721864\n",
      "chicago-house       -0.716238\n",
      "Name: show-tunes, dtype: float64\n"
     ]
    }
   ],
   "source": [
    "print('Least similar to show-tunes:')\n",
    "print(similarity_df['show-tunes'].sort_values(ascending=True).head(6))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76705789",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Most similar to show-tunes:\n",
      "track_genre\n",
      "show-tunes    1.000000\n",
      "romance       0.957365\n",
      "opera         0.905172\n",
      "jazz          0.871246\n",
      "disney        0.795873\n",
      "tango         0.774387\n",
      "Name: show-tunes, dtype: float64\n"
     ]
    }
   ],
   "source": [
    "print('Most similar to show-tunes:')\n",
    "print(similarity_df['show-tunes'].sort_values(ascending=False).head(6))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c80594d4",
   "metadata": {},
   "source": [
    "# Build Initial Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2473bfcf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1c7e38c5720>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# neo4j helper functions\n",
    "\n",
    "# define neo4j connection\n",
    "driver = GraphDatabase.driver(\n",
    "    'bolt://localhost:7687',\n",
    "    auth=('neo4j','205spotify'))\n",
    "\n",
    "session = driver.session(database=\"neo4j\")\n",
    "\n",
    "# convert results to pandas dataframe\n",
    "def my_neo4j_run_query_pandas(query, **kwargs):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        result = session.run(query, **kwargs)\n",
    "        df = pd.DataFrame([r.values() for r in result], columns=result.keys())\n",
    "    return df\n",
    "\n",
    "# run neo4j query\n",
    "def neo4j_run(query, **kwargs):\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        return session.run(query, **kwargs)\n",
    "\n",
    "# wipe neo4j graph\n",
    "# wiping in batches of 5k rows prevents memorypooloutofmemory error when trying to wipe database\n",
    "def neo4j_batch_wipe():\n",
    "    with driver.session(database=\"neo4j\") as session:\n",
    "        batch_wipe_query = \"\"\"\n",
    "        MATCH (n)\n",
    "        CALL {\n",
    "            WITH n\n",
    "            DETACH DELETE n\n",
    "        } IN TRANSACTIONS OF 5000 ROWS\n",
    "        \"\"\"\n",
    "        session.run(batch_wipe_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "81c10581",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Wiping database\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL (n) { ... }', position=<SummaryInputPosition line=3, column=9, offset=27>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 27, 'line': 3, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (n)\\n        CALL {\\n            with n\\n            detach delete n\\n        } in transactions of 5000 rows\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Create nodes\n",
      "Running KNN\n"
     ]
    }
   ],
   "source": [
    "# Build initial Neo4j graph\n",
    "node_query = \"\"\"\n",
    "    UNWIND $rows as row\n",
    "    MERGE (s:Song {id: row.track_id})\n",
    "    SET s.track_name = row.track_name,\n",
    "        s.genre = row.track_genre,\n",
    "        s.artists = row.artists,\n",
    "        s.album = row.album_name,\n",
    "        s.popularity = row.popularity\n",
    "\"\"\"\n",
    "\n",
    "# convert song data to list (neo4j needs this format)\n",
    "node_list = spotify_df.to_dict('records')\n",
    "\n",
    "print('Wiping database')\n",
    "neo4j_batch_wipe()\n",
    "    \n",
    "print('Create nodes')\n",
    "session.run(node_query, rows=node_list)\n",
    "\n",
    "# Create edges using KNN (no genre restriction)\n",
    "print('Running KNN')\n",
    "\n",
    "# match tracks to five nearest neighbors using cosine similarity\n",
    "knn = NearestNeighbors(n_neighbors=6, metric='cosine')\n",
    "knn.fit(spotify_scaled)\n",
    "\n",
    "# get indices of nearest neighbors and their distances to the track located at the corresponding index\n",
    "distances, indices = knn.kneighbors(spotify_scaled)\n",
    "\n",
    "# create list of edges pointing to most similar tracks\n",
    "edges = []\n",
    "\n",
    "for i in range(len(spotify_df)):  \n",
    "    src_id = spotify_df.iloc[i]['track_id']\n",
    "    \n",
    "    for j in range(1, 6):  \n",
    "        nbr_idx = indices[i][j]  \n",
    "        nbr_id = spotify_df.iloc[nbr_idx]['track_id']  \n",
    "        cos_dist = distances[i][j]  \n",
    "\n",
    "        # add data to list of edges\n",
    "        edges.append({\n",
    "            'source_id': src_id,\n",
    "            'target_id': nbr_id,\n",
    "            'distance': float(cos_dist),\n",
    "            'similarity': float(1 - cos_dist)\n",
    "        })\n",
    "\n",
    "# convert edge data to dataframe\n",
    "edges_df = pd.DataFrame(edges)\n",
    "\n",
    "# convert dataframe of edges to list for neo4j\n",
    "edges_list = edges_df.to_dict('records')\n",
    "\n",
    "# run edge query\n",
    "edge_query = \"\"\"\n",
    "    UNWIND $rows AS row\n",
    "    MATCH (source:Song {id: row.source_id})\n",
    "    MATCH (target:Song {id: row.target_id})\n",
    "    MERGE (source)-[r:SIMILAR_TO]->(target)\n",
    "    SET r.similarity = row.similarity,\n",
    "        r.distance   = row.distance,\n",
    "        r.cost = row.distance\n",
    "\"\"\"\n",
    "\n",
    "batch_size = 5000\n",
    "for start in range(0, len(edges_list), batch_size):\n",
    "    batch = edges_list[start:start + batch_size]\n",
    "    neo4j_run(edge_query, rows=batch)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c53b11d",
   "metadata": {},
   "source": [
    "# Graph Projection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "759bc91c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x1c7e39135b0>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# CREATE GRAPH PROJECTION\n",
    "\n",
    "# standardize relationship properties\n",
    "sr_query = \"\"\"\n",
    "MATCH ()-[r:SIMILAR_TO]->()\n",
    "SET r.similarity = r.similarity,\n",
    "    r.cost = r.distance\n",
    "\"\"\"\n",
    "neo4j_run(sr_query)\n",
    "\n",
    "# drop previous in memory graph projection\n",
    "drop_proj_query = \"\"\"\n",
    "CALL gds.graph.exists('song_graph') YIELD exists\n",
    "WITH exists\n",
    "CALL {\n",
    "    WITH exists\n",
    "    WHERE exists\n",
    "    CALL gds.graph.drop('song_graph', false) YIELD graphName\n",
    "    RETURN graphName\n",
    "}\n",
    "RETURN coalesce(graphName, 'not_found') AS graphName\n",
    "\"\"\"\n",
    "neo4j_run(drop_proj_query)\n",
    "\n",
    "# project graph with both edge types\n",
    "new_proj_query = \"\"\"\n",
    "CALL gds.graph.project(\n",
    "    'song_graph',\n",
    "    'Song',\n",
    "    {\n",
    "        SIMILAR_TO: {\n",
    "            orientation: 'UNDIRECTED',\n",
    "            properties: ['similarity', 'cost']\n",
    "        }\n",
    "    }\n",
    ")\n",
    "\"\"\"\n",
    "neo4j_run(new_proj_query)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e2c02464",
   "metadata": {},
   "source": [
    "# Louvain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "95a2fbc4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "   communityCount  modularity\n",
      "0              39    0.878878\n",
      "Total Communities: 39\n",
      "\n",
      "                 track_id                          track_name       genre  \\\n",
      "0  3KKk48f33mlB56F5L5nbJk  \"Don Carlos\" Roderigo'S Death Aria     romance   \n",
      "1  5OiONTndVC5YOMXg6VC5xs    \"Eugene Onegin\" Ariozo Of Onegin     romance   \n",
      "2  5ezuHIXXlsPQY4rbsSKT1W                       \"He Was Tall\"  show-tunes   \n",
      "3  280zqg7gblMTRU1Hc5VxpY             \"Loneliness Of Evening\"  show-tunes   \n",
      "4  6ua4ZcCoSABREsczFvGLI6                  'O Sole Mio - Live       opera   \n",
      "\n",
      "   community  \n",
      "0       4252  \n",
      "1       4252  \n",
      "2       4252  \n",
      "3       4252  \n",
      "4       4252  \n"
     ]
    }
   ],
   "source": [
    "# run louvain for communityID\n",
    "louvain_query = \"\"\"\n",
    "CALL gds.louvain.stream(\n",
    "    'song_graph',\n",
    "    {\n",
    "        relationshipWeightProperty: 'similarity'\n",
    "    }\n",
    ")\n",
    "YIELD nodeId, communityId\n",
    "RETURN\n",
    "    gds.util.asNode(nodeId).id AS track_id,\n",
    "    gds.util.asNode(nodeId).track_name AS track_name,\n",
    "    gds.util.asNode(nodeId).genre AS genre,\n",
    "    communityId AS community\n",
    "ORDER BY community, track_name\n",
    "\"\"\"\n",
    "\n",
    "# write communityIDs back to songs in neo4j\n",
    "# this will assist pathing process later\n",
    "lou_write_query = \"\"\"\n",
    "CALL gds.louvain.write(\n",
    "    'song_graph',\n",
    "    {\n",
    "        relationshipWeightProperty: 'similarity',\n",
    "        writeProperty: 'community'\n",
    "    }\n",
    ")\n",
    "YIELD communityCount, modularity\n",
    "RETURN communityCount, modularity\n",
    "\"\"\"\n",
    "\n",
    "louvain_write = my_neo4j_run_query_pandas(lou_write_query)\n",
    "print('')\n",
    "print(louvain_write)\n",
    "\n",
    "# store louvain results to assist in pathing\n",
    "louvain_df = my_neo4j_run_query_pandas(\"\"\"\n",
    "    MATCH (s:Song)\n",
    "    RETURN s.id AS track_id,\n",
    "           s.track_name AS track_name,\n",
    "           s.genre AS genre,\n",
    "           s.community AS community\n",
    "    ORDER BY community, track_name\n",
    "\"\"\")\n",
    "\n",
    "print('Total Communities:', louvain_df['community'].nunique())\n",
    "print('')\n",
    "print(louvain_df.head())\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "88753f2f",
   "metadata": {},
   "source": [
    "## Degree Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "83498c6f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                 track_id   betweenness\n",
      "0  36YlzbkAZLnOke9yib6Yin  68628.543564\n",
      "1  0oiXA5d3B3QAbHFwom7OJZ  55722.371948\n",
      "2  395WRTyNwMGx80cDXqg6vM  51580.578798\n",
      "3  3FSF2F62qs9Y5Ak65nqGsx  43903.079588\n",
      "4  3mS1DMR2N8eQ0qGezDPTOx  43226.009454\n",
      "\n",
      "   nodePropertiesWritten\n",
      "0                  81343\n"
     ]
    }
   ],
   "source": [
    "# DEGREE CENTRALITY\n",
    "# run degree centrality\n",
    "degree_query = \"\"\"\n",
    "CALL gds.degree.stream('song_graph')\n",
    "YIELD nodeId, score\n",
    "RETURN\n",
    "    gds.util.asNode(nodeId).id AS track_id,\n",
    "    score AS degree\n",
    "ORDER BY degree DESC\n",
    "\"\"\"\n",
    "\n",
    "degree_df = my_neo4j_run_query_pandas(degree_query)\n",
    "\n",
    "print(degree_df.head())\n",
    "print('')\n",
    "\n",
    "# write degree scores back to nodes in neo4j\n",
    "degree_write_query = \"\"\"\n",
    "CALL gds.degree.write(\n",
    "    'song_graph',\n",
    "    {\n",
    "        writeProperty: 'degree'\n",
    "    }\n",
    ")\n",
    "YIELD nodePropertiesWritten\n",
    "RETURN nodePropertiesWritten\n",
    "\"\"\"\n",
    "\n",
    "degree_write = my_neo4j_run_query_pandas(degree_write_query)\n",
    "print(degree_write)\n",
    "\n",
    "# merge degree to louvain_df to build set of relevant features\n",
    "track_feats = louvain_df.merge(\n",
    "    degree_df[['track_id', 'degree']],\n",
    "    on='track_id',\n",
    "    how='left'\n",
    ")\n",
    "track_feats['degree'] = track_feats['degree'].fillna(0)\n",
    "\n",
    "# merge popularity back to features to choose most popular song first\n",
    "track_feats = track_feats.merge(\n",
    "    spotify_df[['track_id', 'popularity']],\n",
    "    on='track_id',\n",
    "    how='left'\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2131f32a",
   "metadata": {},
   "source": [
    "## Betweenness Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "02295708",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                 track_id   betweenness\n",
      "0  0oiXA5d3B3QAbHFwom7OJZ  92955.649434\n",
      "1  3FSF2F62qs9Y5Ak65nqGsx  77373.093595\n",
      "2  2kkvB3RNRzwjFdGhaUA0tz  73212.965358\n",
      "3  4O5xErTIU7SLQ6QJ6SUc0D  62884.592812\n",
      "4  4TZh9HGsgaH3qzX40TPsF3  62684.789205\n",
      "\n",
      "   nodePropertiesWritten\n",
      "0                  81343\n"
     ]
    }
   ],
   "source": [
    "# run approximate betweenness centrality (UNWEIGHTED)\n",
    "bw_query = \"\"\"\n",
    "CALL gds.betweenness.stream(\n",
    "    'song_graph',\n",
    "    {\n",
    "        samplingSize: 100,\n",
    "        samplingSeed: 0\n",
    "    }\n",
    ")\n",
    "YIELD nodeId, score\n",
    "RETURN\n",
    "    gds.util.asNode(nodeId).id AS track_id,\n",
    "    score AS betweenness\n",
    "ORDER BY betweenness DESC\n",
    "\"\"\"\n",
    "\n",
    "betweenness_df = my_neo4j_run_query_pandas(\n",
    "    bw_query,\n",
    "    sampling_size=100,\n",
    "    sampling_seed=0\n",
    ")\n",
    "\n",
    "print(betweenness_df.head())\n",
    "print('')\n",
    "\n",
    "# write betweenness scores back to nodes in neo4j\n",
    "bw_write_query = \"\"\"\n",
    "CALL gds.betweenness.write(\n",
    "    'song_graph',\n",
    "    {\n",
    "        samplingSize: 100,\n",
    "        samplingSeed: 0,\n",
    "        writeProperty: 'betweenness'\n",
    "    }\n",
    ")\n",
    "YIELD nodePropertiesWritten\n",
    "RETURN nodePropertiesWritten\n",
    "\"\"\"\n",
    "\n",
    "between_write = my_neo4j_run_query_pandas(bw_write_query)\n",
    "print(between_write)\n",
    "\n",
    "# merge betweenness into existing track features\n",
    "track_feats = track_feats.merge(\n",
    "    betweenness_df[['track_id', 'betweenness']],\n",
    "    on='track_id',\n",
    "    how='left'\n",
    ")\n",
    "track_feats['betweenness'] = track_feats['betweenness'].fillna(0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a0e56417",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>track_name</th>\n",
       "      <th>artists</th>\n",
       "      <th>betweenness</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>By My Side</td>\n",
       "      <td>Massane;MAGNUS</td>\n",
       "      <td>92955.649434</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Angha</td>\n",
       "      <td>Mehdi Khayami;Lorenzo Gorli</td>\n",
       "      <td>77373.093595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Layla</td>\n",
       "      <td>Derek &amp; The Dominos</td>\n",
       "      <td>73212.965358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Ocean Sounds: Relaxing Wind - Loopable</td>\n",
       "      <td>The Ocean Waves Sounds</td>\n",
       "      <td>62884.592812</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Wenn Baby nicht schläft</td>\n",
       "      <td>Weißes Rauschen HD</td>\n",
       "      <td>62684.789205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Tzigane, M. 76 (Version for Violin &amp; Orchestra...</td>\n",
       "      <td>Maurice Ravel;Luis Perez Canabal;Central Washi...</td>\n",
       "      <td>62564.242524</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Čtyři Slunce</td>\n",
       "      <td>Vypsana Fixa</td>\n",
       "      <td>61829.527186</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Twenty Two</td>\n",
       "      <td>Farzad Golpayegani</td>\n",
       "      <td>59186.858033</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Dom fyra årstiderna</td>\n",
       "      <td>Håkan Hellström</td>\n",
       "      <td>56278.093893</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Waves To Sleep</td>\n",
       "      <td>Ocean Waves For Sleep</td>\n",
       "      <td>56095.302414</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Calming Pacific Ocean Roar to Induce Healing D...</td>\n",
       "      <td>White Noise Baby Sleep</td>\n",
       "      <td>51487.836882</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           track_name  \\\n",
       "0                                          By My Side   \n",
       "1                                               Angha   \n",
       "2                                               Layla   \n",
       "3              Ocean Sounds: Relaxing Wind - Loopable   \n",
       "4                             Wenn Baby nicht schläft   \n",
       "5   Tzigane, M. 76 (Version for Violin & Orchestra...   \n",
       "6                                        Čtyři Slunce   \n",
       "7                                          Twenty Two   \n",
       "8                                 Dom fyra årstiderna   \n",
       "9                                      Waves To Sleep   \n",
       "10  Calming Pacific Ocean Roar to Induce Healing D...   \n",
       "\n",
       "                                              artists   betweenness  \n",
       "0                                      Massane;MAGNUS  92955.649434  \n",
       "1                         Mehdi Khayami;Lorenzo Gorli  77373.093595  \n",
       "2                                 Derek & The Dominos  73212.965358  \n",
       "3                              The Ocean Waves Sounds  62884.592812  \n",
       "4                                  Weißes Rauschen HD  62684.789205  \n",
       "5   Maurice Ravel;Luis Perez Canabal;Central Washi...  62564.242524  \n",
       "6                                        Vypsana Fixa  61829.527186  \n",
       "7                                  Farzad Golpayegani  59186.858033  \n",
       "8                                     Håkan Hellström  56278.093893  \n",
       "9                               Ocean Waves For Sleep  56095.302414  \n",
       "10                             White Noise Baby Sleep  51487.836882  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "top_bw = betweenness_df.head(11) \n",
    "top_bw.merge(\n",
    "    spotify_df[['track_id', 'track_name', 'artists']], \n",
    "    how='inner', \n",
    "    on='track_id'\n",
    ")[['track_name', 'artists', 'betweenness']]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7bdd0910",
   "metadata": {},
   "source": [
    "## Identify Target Community\n",
    "Calculate centroids of each community\n",
    "Find community whose centroid is the closest to the input/source community and set it as target"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "35902bff",
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_target_community(input_community, track_feats, spotify_scaled, spotify_df):\n",
    "    # dictionary mapping track_id to its index in initial spotify data\n",
    "    map_id_to_idx = {row['track_id']: i for i, row in spotify_df.iterrows()}\n",
    "\n",
    "    community_centroids = {}\n",
    "    \n",
    "\n",
    "    for community, group in track_feats.groupby('community'):  \n",
    "        # get the index for every track in this community and drop duplicates\n",
    "        idxs = [map_id_to_idx[tid] for tid in group['track_id'] if tid in map_id_to_idx]\n",
    "        \n",
    "        # get only songs in this community\n",
    "        community_centroids[community] = spotify_scaled[idxs].mean(axis=0)\n",
    "\n",
    "    # get centroid for input/source song's community\n",
    "    input_centroid = community_centroids[input_community]\n",
    "\n",
    "    # initialize variables to track closest community search\n",
    "    best_community = None\n",
    "    best_distance  = float('inf')\n",
    "\n",
    "    # loop through every community and compare its centroid to input/source community's centroid\n",
    "    for community, centroid in community_centroids.items():\n",
    "        if community == input_community:\n",
    "            continue\n",
    "        \n",
    "        # calculate euclidean distance between centroids\n",
    "        dist = np.linalg.norm(input_centroid - centroid)\n",
    "        if dist < best_distance:  \n",
    "            best_distance = dist \n",
    "            best_community = community  \n",
    "\n",
    "    return best_community\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e4fa3bc8",
   "metadata": {},
   "source": [
    "## Find Bridge Song"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f0a0214e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def find_bridge_song(input_community, target_community):\n",
    "    # query orders results by descending betweenness and filters for top result\n",
    "    # also filters for tracks where edges are in both input and target community\n",
    "    bridge_query = \"\"\"\n",
    "        MATCH (bridge:Song)-[:SIMILAR_TO]-(a:Song),\n",
    "              (bridge:Song)-[:SIMILAR_TO]-(b:Song)\n",
    "        WHERE a.community = $input_community\n",
    "          AND b.community = $target_community\n",
    "          AND bridge.community <> $input_community\n",
    "          AND bridge.betweenness IS NOT NULL\n",
    "        RETURN DISTINCT\n",
    "            bridge.id AS track_id,\n",
    "            bridge.track_name AS track_name,\n",
    "            bridge.genre AS genre,\n",
    "            bridge.community AS community,\n",
    "            bridge.betweenness AS betweenness\n",
    "        ORDER BY betweenness DESC\n",
    "        LIMIT 1\n",
    "    \"\"\"\n",
    "\n",
    "    result = my_neo4j_run_query_pandas(\n",
    "        bridge_query,\n",
    "        input_community=int(input_community),\n",
    "        target_community=int(target_community)\n",
    "    )\n",
    "\n",
    "    if result.empty:\n",
    "        return None, None\n",
    "\n",
    "    best = result.iloc[0]\n",
    "    return best['track_id'], int(best['community'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7315064e",
   "metadata": {},
   "source": [
    "## Decide on destination"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "42ea5173",
   "metadata": {},
   "outputs": [],
   "source": [
    "# pick a destination track\n",
    "def pick_destination(target_comm, bridge_id):\n",
    "    target_query = \"\"\"\n",
    "    MATCH (s:Song)\n",
    "    WHERE s.community = $target_community\n",
    "    AND s.id <> $bridge_track_id\n",
    "    RETURN \n",
    "        s.id AS track_id, s.track_name AS track_name,\n",
    "        s.genre AS genre, s.popularity AS popularity\n",
    "    ORDER BY popularity DESC\n",
    "    LIMIT 20\n",
    "    \"\"\"\n",
    "\n",
    "    target_output = my_neo4j_run_query_pandas(\n",
    "        target_query,\n",
    "        target_community=int(target_comm),\n",
    "        bridge_track_id=bridge_id\n",
    "    )\n",
    "\n",
    "    rand_target_idxs = np.random.default_rng(0)\n",
    "\n",
    "    target_track = target_output.iloc[rand_target_idxs.integers(0, len(target_output))]\n",
    "\n",
    "    return target_track"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6317c8e1",
   "metadata": {},
   "source": [
    "# Dijkstra (Shortest Path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "de38dfbd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# define Dijkstra helper function to find shortest path by segmenting into two paths:\n",
    "# path 1: shortest input to bridge\n",
    "# path 2: shortest bridge to target\n",
    "\n",
    "def shortest_path(start_track_id, target_track_id):\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (source:Song {id: $source_id}), (target:Song {id: $target_id})\n",
    "    CALL gds.shortestPath.dijkstra.stream('song_graph',\n",
    "        {\n",
    "            sourceNode: source,\n",
    "            targetNode: target,\n",
    "            relationshipWeightProperty: 'cost'\n",
    "        }\n",
    "    )\n",
    "    YIELD totalCost, nodeIds\n",
    "    RETURN\n",
    "        totalCost,\n",
    "        [nodeId IN nodeIds | gds.util.asNode(nodeId).id] AS track_ids,\n",
    "        [nodeId IN nodeIds | gds.util.asNode(nodeId).track_name] AS track_names,\n",
    "        [nodeId IN nodeIds | gds.util.asNode(nodeId).artists] AS artists,\n",
    "        [nodeId IN nodeIds | gds.util.asNode(nodeId).genre] AS genres,\n",
    "        [nodeId IN nodeIds | gds.util.asNode(nodeId).community]  AS communities\n",
    "    \"\"\"\n",
    "\n",
    "    path_result = my_neo4j_run_query_pandas(\n",
    "        query,\n",
    "        source_id=start_track_id,\n",
    "        target_id=target_track_id\n",
    "    )\n",
    "    #print(path_result)\n",
    "\n",
    "    path = path_result.iloc[0]\n",
    "\n",
    "    path_df = pd.DataFrame({\n",
    "        'track_id': path['track_ids'],\n",
    "        'track_name': path['track_names'],\n",
    "        'artist': path['artists'],\n",
    "        'genre': path['genres'],\n",
    "        'community': path['communities']\n",
    "    })\n",
    "\n",
    "    path_df['total_cost'] = path['totalCost']\n",
    "\n",
    "    return path_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3eaf2c75",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_queue(input_track_name):\n",
    "\n",
    "    # search track data for songs that are a match to the input song\n",
    "    # sort to get most popular song \n",
    "    matches = track_feats[\n",
    "        track_feats['track_name'].str.lower().str.contains(input_track_name.lower(), na=False)\n",
    "    ].sort_values('popularity', ascending=False)\n",
    "\n",
    "    if matches.empty:\n",
    "        raise ValueError(f\"No matches found for '{input_track_name}'\")\n",
    "\n",
    "    # select most popular song\n",
    "    input_song = matches.iloc[0]\n",
    "    \n",
    "    # get track id to use to identify node in neo4j\n",
    "    input_id = input_song['track_id']\n",
    "    \n",
    "    # get louvain community that input song belongs to\n",
    "    input_community = int(input_song['community'])\n",
    "\n",
    "    # pick a few familiar songs from the same community using degree centrality\n",
    "    familiar_songs = track_feats[\n",
    "        (track_feats['community'] == input_community) &\n",
    "        (track_feats['track_id'] != input_id)\n",
    "    ].sort_values(['degree', 'popularity'], ascending=False).head(3)\n",
    "\n",
    "    familiar_ids = [input_id] + familiar_songs['track_id'].tolist()\n",
    "\n",
    "    # run target community function \n",
    "    target_community = find_target_community(\n",
    "        input_community, track_feats, spotify_scaled, spotify_df\n",
    "    )\n",
    "\n",
    "    # run bridge song finder function\n",
    "    bridge_id, bridge_community = find_bridge_song(input_community, target_community)\n",
    "\n",
    "    if bridge_id is None:\n",
    "        raise ValueError(\"No bridge song found between input and target communities.\")\n",
    "    \n",
    "    # pick a destination/target song in target community\n",
    "    dest_row = pick_destination(target_community, bridge_id)\n",
    "    \n",
    "    # determine shortest path\n",
    "    path1 = shortest_path(familiar_ids[-1], bridge_id)  # last familiar song to bridge\n",
    "    path2 = shortest_path(bridge_id, dest_row['track_id'])  # bridge to target\n",
    "\n",
    "    # build dataframe for familiar songs in the chosen order\n",
    "    familiar_path = track_feats[\n",
    "        track_feats['track_id'].isin(familiar_ids)\n",
    "    ][['track_id', 'track_name', 'genre', 'community']].copy()\n",
    "\n",
    "    familiar_path = familiar_path.set_index('track_id').loc[familiar_ids].reset_index()\n",
    "    familiar_path['artist'] = familiar_path['track_id'].map(\n",
    "        spotify_df.set_index('track_id')['artists']\n",
    "    )\n",
    "    familiar_path['total_cost'] = 0\n",
    "\n",
    "    # combine familiar songs + shortest paths\n",
    "    final_path = pd.concat(\n",
    "        [familiar_path, path1.iloc[1:], path2.iloc[1:]],\n",
    "        ignore_index=True\n",
    "    )\n",
    "    \n",
    "    # prevent queue from playing same song more than once\n",
    "    final_path = final_path.drop_duplicates(subset='track_id', keep='first')\n",
    "    final_path = final_path.drop_duplicates(subset='track_name', keep='first')\n",
    "    final_path = final_path.reset_index(drop=True)\n",
    "\n",
    "    return final_path"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f4687842",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>track_id</th>\n",
       "      <th>track_name</th>\n",
       "      <th>artist</th>\n",
       "      <th>genre</th>\n",
       "      <th>community</th>\n",
       "      <th>total_cost</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4u7EnebtmKWzUH433cf5Qv</td>\n",
       "      <td>Bohemian Rhapsody - Remastered 2011</td>\n",
       "      <td>Queen</td>\n",
       "      <td>rock</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>5Rm70bhYNH2eTtHjlwgPY0</td>\n",
       "      <td>The Passion (Live Acoustic) - Bonus</td>\n",
       "      <td>Hillsong Worship;Brooke Ligertwood</td>\n",
       "      <td>world-music</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2PHJSiIQQgVAuHqSxEp6F9</td>\n",
       "      <td>軌跡</td>\n",
       "      <td>Jay Chou</td>\n",
       "      <td>mandopop</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0M8g4Bt0R12Y3U9MM9oXaT</td>\n",
       "      <td>Mary</td>\n",
       "      <td>Oingo Boingo</td>\n",
       "      <td>synth-pop</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1KHdq8NK9QxnGjdXb55NiG</td>\n",
       "      <td>Falling in Love at a Coffee Shop</td>\n",
       "      <td>Landon Pigg</td>\n",
       "      <td>acoustic</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5wTJw7Eu5mi0AqSYyIZLQs</td>\n",
       "      <td>O Rosto de Cristo</td>\n",
       "      <td>Sarah Farias</td>\n",
       "      <td>gospel</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>3RIYWuMEasEhXVNx722ZOC</td>\n",
       "      <td>Champagne Supernova</td>\n",
       "      <td>OneRepublic</td>\n",
       "      <td>piano</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>58AS4weYlUWvGztZbKIuAU</td>\n",
       "      <td>Leave Out All The Rest</td>\n",
       "      <td>Linkin Park</td>\n",
       "      <td>alternative</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>3j6s1vr84KzKlpF0QfHzDy</td>\n",
       "      <td>Army</td>\n",
       "      <td>Besomorph;Arcando;Neoni</td>\n",
       "      <td>house</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>4YXKVaWzHaVyDq2pVS5cgR</td>\n",
       "      <td>Proud</td>\n",
       "      <td>Marshmello</td>\n",
       "      <td>progressive-house</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>7AcfLjRYL1LeiUHUU302Fm</td>\n",
       "      <td>Fuck U Love U</td>\n",
       "      <td>Alison Wonderland</td>\n",
       "      <td>electronic</td>\n",
       "      <td>57363</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>7qfZTBNZQqvg0hMamrAQB1</td>\n",
       "      <td>Zombie - Bassjackers Remix</td>\n",
       "      <td>Ran-D;Bassjackers</td>\n",
       "      <td>hardstyle</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>5M2f7YbqT2m2uOlUJNkDIP</td>\n",
       "      <td>Sam Dam Dand Bhed</td>\n",
       "      <td>Kailash Kher</td>\n",
       "      <td>folk</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>487Ump1JOYK3wSqB6KIOUd</td>\n",
       "      <td>Solitude</td>\n",
       "      <td>Hybrid Minds;Alexa Harley</td>\n",
       "      <td>drum-and-bass</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>5CrShYXYibJD0kx4q56xhZ</td>\n",
       "      <td>反方向的鐘</td>\n",
       "      <td>Jay Chou</td>\n",
       "      <td>mandopop</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>5nFjGMZucdlzOIbGYFWNcL</td>\n",
       "      <td>What We Do</td>\n",
       "      <td>Aexcit</td>\n",
       "      <td>deep-house</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.120060</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>4AiRurYyWjJtjkSyRiWxSQ</td>\n",
       "      <td>Back To You</td>\n",
       "      <td>X-Pander</td>\n",
       "      <td>hardstyle</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.028385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>0TYBkC9jZ5b8FPW7kn673t</td>\n",
       "      <td>Terrified</td>\n",
       "      <td>Trespassed;MC Robs</td>\n",
       "      <td>hardcore</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.028385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>09qA7f3qumec6qaTEVeL7Q</td>\n",
       "      <td>Jesus Frankenstein</td>\n",
       "      <td>Rob Zombie</td>\n",
       "      <td>industrial</td>\n",
       "      <td>77474</td>\n",
       "      <td>0.028385</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  track_id                           track_name  \\\n",
       "0   4u7EnebtmKWzUH433cf5Qv  Bohemian Rhapsody - Remastered 2011   \n",
       "1   5Rm70bhYNH2eTtHjlwgPY0  The Passion (Live Acoustic) - Bonus   \n",
       "2   2PHJSiIQQgVAuHqSxEp6F9                                   軌跡   \n",
       "3   0M8g4Bt0R12Y3U9MM9oXaT                                 Mary   \n",
       "4   1KHdq8NK9QxnGjdXb55NiG     Falling in Love at a Coffee Shop   \n",
       "5   5wTJw7Eu5mi0AqSYyIZLQs                    O Rosto de Cristo   \n",
       "6   3RIYWuMEasEhXVNx722ZOC                  Champagne Supernova   \n",
       "7   58AS4weYlUWvGztZbKIuAU               Leave Out All The Rest   \n",
       "8   3j6s1vr84KzKlpF0QfHzDy                                 Army   \n",
       "9   4YXKVaWzHaVyDq2pVS5cgR                                Proud   \n",
       "10  7AcfLjRYL1LeiUHUU302Fm                        Fuck U Love U   \n",
       "11  7qfZTBNZQqvg0hMamrAQB1           Zombie - Bassjackers Remix   \n",
       "12  5M2f7YbqT2m2uOlUJNkDIP                    Sam Dam Dand Bhed   \n",
       "13  487Ump1JOYK3wSqB6KIOUd                             Solitude   \n",
       "14  5CrShYXYibJD0kx4q56xhZ                                反方向的鐘   \n",
       "15  5nFjGMZucdlzOIbGYFWNcL                           What We Do   \n",
       "16  4AiRurYyWjJtjkSyRiWxSQ                          Back To You   \n",
       "17  0TYBkC9jZ5b8FPW7kn673t                            Terrified   \n",
       "18  09qA7f3qumec6qaTEVeL7Q                   Jesus Frankenstein   \n",
       "\n",
       "                                artist              genre  community  \\\n",
       "0                                Queen               rock      57363   \n",
       "1   Hillsong Worship;Brooke Ligertwood        world-music      57363   \n",
       "2                             Jay Chou           mandopop      57363   \n",
       "3                         Oingo Boingo          synth-pop      57363   \n",
       "4                          Landon Pigg           acoustic      57363   \n",
       "5                         Sarah Farias             gospel      57363   \n",
       "6                          OneRepublic              piano      57363   \n",
       "7                          Linkin Park        alternative      57363   \n",
       "8              Besomorph;Arcando;Neoni              house      57363   \n",
       "9                           Marshmello  progressive-house      57363   \n",
       "10                   Alison Wonderland         electronic      57363   \n",
       "11                   Ran-D;Bassjackers          hardstyle      77474   \n",
       "12                        Kailash Kher               folk      77474   \n",
       "13           Hybrid Minds;Alexa Harley      drum-and-bass      77474   \n",
       "14                            Jay Chou           mandopop      77474   \n",
       "15                              Aexcit         deep-house      77474   \n",
       "16                            X-Pander          hardstyle      77474   \n",
       "17                  Trespassed;MC Robs           hardcore      77474   \n",
       "18                          Rob Zombie         industrial      77474   \n",
       "\n",
       "    total_cost  \n",
       "0     0.120060  \n",
       "1     0.120060  \n",
       "2     0.120060  \n",
       "3     0.120060  \n",
       "4     0.120060  \n",
       "5     0.120060  \n",
       "6     0.120060  \n",
       "7     0.120060  \n",
       "8     0.120060  \n",
       "9     0.120060  \n",
       "10    0.120060  \n",
       "11    0.120060  \n",
       "12    0.120060  \n",
       "13    0.120060  \n",
       "14    0.120060  \n",
       "15    0.120060  \n",
       "16    0.028385  \n",
       "17    0.028385  \n",
       "18    0.028385  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# run function to generate queue\n",
    "\n",
    "# define starting track\n",
    "input_track_name = 'bohemian rhapsody'\n",
    "\n",
    "generate_queue(input_track_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4c4df4ae",
   "metadata": {},
   "source": [
    "Note: to see edges in Neo4j browser, run:\n",
    "\n",
    "MATCH (s:Song)-[r]->(n:Song) <br>\n",
    "RETURN s, r, n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "mids",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
